config.org
#+title: Doom Emacs Config
#+author: Michael Neuper

* Doom
#+begin_src emacs-lisp
;; Whenever you reconfigure a package, make sure to wrap your config in an
;; `after!' block, otherwise Doom's defaults may override your settings. E.g.

;;   (after! PACKAGE
;;     (setq x y))

;; The exceptions to this rule:
;;     - Setting file/directory variables (like `org-directory')
;;     - Setting variables which explicitly tell you to set them before their
;;         package is loaded (see 'C-h v VARIABLE' to look up their documentation).
;;     - Setting doom variables (which start with 'doom-' or '+').

;; Here are some additional functions/macros that will help you configure Doom.

;;     - `load!' for loading external *.el files relative to this one
;;     - `use-package!' for configuring packages
;;     - `after!' for running code after a package has loaded
;;     - `add-load-path!' for adding directories to the `load-path', relative to
;;          this file. Emacs searches the `load-path' when you load packages with
;;         `require' or `use-package'.
;;     - `map!' for binding new keys

;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
;; This will open documentation for it, including demos of how they are used.
;; Alternatively, use `C-h o' to look up a symbol (functions, variables, faces,
;; etc).

;; You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
;; they are implemented.
#+end_src

Make emacs faster
#+begin_src emacs-lisp
(use-package! gcmh
  :init
  (setq gcmh-idle-delay 5
        gcmh-high-cons-threshold (* 256 1024 1024))  ; 256MB during idle
  :config
  (gcmh-mode 1))

(setq gc-cons-threshold 200000000) ; previous 33554432
#+end_src

* Configuration
** Local Leader Key
Remap <localleader> from m to l to avoid conflict with spotify bindings.

#+begin_src emacs-lisp
(setq doom-localleader-key "SPC l"
      doom-localleader-alt-key "M-SPC l")
#+end_src

** Auto-Save and Backup
#+begin_src emacs-lisp
(setq auto-save-default t
      make-backup-files t)
#+end_src

** Confirm Kill Emacs
Kill emacs without confirming.

#+begin_src emacs-lisp
(setq confirm-kill-emacs nil)
#+end_src

** Credentials
#+begin_src emacs-lisp
(setq user-full-name "Michael Neuper"
      user-mail-address "michael@michaelneuper.com")
#+end_src

** API Keys
Import API keys used for various programs.

#+begin_src emacs-lisp
(load! "api-keys.el")
#+end_src

** MacOS Specific
Set modifier keys.
#+begin_src emacs-lisp
(when IS-MAC
  (setq mac-command-modifier 'meta
        mac-option-modifier 'super
        mac-right-option-modifier 'none))
#+end_src

Fix using keychain.
#+begin_src emacs-lisp
(after! auth-source
  (setq auth-sources (nreverse auth-sources)))
#+end_src

Titlebar.
#+begin_src emacs-lisp
(add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))  
(add-to-list 'default-frame-alist '(ns-appearance . dark)) 
#+end_src

** Keybindings
#+begin_src emacs-lisp
(map! :leader
      (:prefix "t"
       :desc "Calc"
       "c" #'calc
       :desc "Eshell"
       "e" #'+eshell/toggle
       :desc "Scroll bar"
       "s" #'scroll-bar-mode
       :desc "Vterm"
       "v" #'+vterm/toggle))

(global-set-key (kbd "<f4>") #'deadgrep)
(global-set-key (kbd "<f3>") #'ibuffer)
#+end_src

* Window Management
** Split Window Behaviour
Focus split window.
#+begin_src emacs-lisp
(setq evil-split-window-below t
      evil-vsplit-window-right t)
#+end_src

** Prompt for Buffers
Ask what buffer to switch to when doing a split.
#+begin_src emacs-lisp
(defadvice! prompt-for-buffers (&rest _)
  :after '(evil-window-split evil-window-vsplit)
  (consult-buffer))
#+end_src

* Interface
** Basic
*** UI Elements
#+begin_src emacs-lisp
;; (scroll-bar-mode 1)
;; (blink-cursor-mode 1)

;; mac specific
(when IS-MAC
  (display-battery-mode 1))
#+end_src

*** Theme
Use doom-one theme.
#+begin_src emacs-lisp
(setq doom-theme 'doom-gruvbox)
#+end_src

Other good looking themes (ranked):
- doom-one
- doom-snazzy
- doom-dark+
- doom-xcode
- doom-material

*** Faces
#+begin_src emacs-lisp
;; (custom-set-faces!
;;   '(doom-dashboard-banner :inherit default)
;;   '(doom-dashboard-loaded :inherit default)
;;   '(dashboard-banner :inherrit default))

;; (custom-set-faces!
;;   '(dashboard-startup-banner :inherit default))
#+end_src

*** Line Numbers
Enable relative line numbers.
Number them relatively (better view with folded org headings).

#+begin_src emacs-lisp
(setq display-line-numbers-type 'relative)
(setq display-line-numbers-mode 'visual)
(setq display-line-numbers 'visual)
#+end_src

*** Column Indicator
Display column indicator after 80 characters in programming mode.

#+begin_src emacs-lisp
(setq display-fill-column-indicator-column 80)
(add-hook 'prog-mode-hook #'display-fill-column-indicator-mode)
#+end_src

*** Pixel Scroll
Enable pixel precision scrolling.

#+begin_src emacs-lisp
(when (version< "29.0.50" emacs-version)
  (pixel-scroll-precision-mode 1))
#+end_src

*** Fonts
Set doom fonts.

Best looking fonts:
 - JetBrains Mono
 - Cascadia Code
 - Comic Shanns Mono
 - Code New Roman
 - Fira Code
 - Inconsolata

#+begin_src emacs-lisp
(cond (IS-LINUX
       (setq doom-font (font-spec :family "Fira Code" :size 12.5)
             doom-variable-pitch-font (font-spec :family "Noto Sans" :size 15)))
      (IS-MAC
       (setq doom-font (font-spec :family "JetBrainsMono Nerd Font" :size 15.5))
       (setq doom-symbol-font (font-spec :family "Cascadia Code" :size 15.5))))
#+end_src

Italicize comments.

#+begin_src emacs-lisp
(after! doom-themes
  (setq doom-themes-enable-bold t))
        ;; doom-themes-enable-italic t))

;; (custom-set-faces!
;;   '(font-lock-comment-face :slant italic)
;;   '(font-lock-keyword-face :slant italic))
#+end_src

Disable certain ligatures.

#+begin_src emacs-lisp
;; (plist-put! +ligatures-extra-symbols
;;             :and           nil
;;             :or            nil
;;             :not           nil
;;             :true          nil
;;             :false         nil
;;             :int           nil
;;             :float         nil
;;             :str           nil
;;             :bool          nil
;;             :list          nil)
#+end_src

Enable certain ligatures.

#+begin_src emacs-lisp
(after! org
  (setq org-ellipsis " ▾ ")
  ;; (appendq! +ligatures-extra-symbols
  ;;           `(:checkbox      "☐"
  ;;             :pending       "◼"
  ;;             :checkedbox    "☑"
  ;;             :list_property "∷"
  ;;             :em_dash       "—"
  ;;             :ellipses      "…"
  ;;             :arrow_right   "→"
  ;;             :arrow_left    "←"
  ;;             :begin_quote   "❝"
  ;;             :end_quote     "❞"
  ;;             :header        "›"
  ;;             :priority_a   ,(propertize "⚑" 'face 'all-the-icons-red)
  ;;             :priority_b   ,(propertize "⬆" 'face 'all-the-icons-orange)
  ;;             :priority_c   ,(propertize "■" 'face 'all-the-icons-yellow)
  ;;             :priority_d   ,(propertize "⬇" 'face 'all-the-icons-green)
  ;;             :priority_e   ,(propertize "❓" 'face 'all-the-icons-blue)
  ;;             :roam_tags nil
  ;;             :filetags nil))
  (set-ligatures! 'org-mode
    :merge t
    :checkbox      "[ ]"
    :pending       "[-]"
    :checkedbox    "[X]"
    :list_property "::"
    :em_dash       "---"
    :ellipsis      "..."
    :arrow_right   "->"
    :arrow_left    "<-"
    :title         "#+title:"
    :subtitle      "#+subtitle:"
    :author        "#+author:"
    :date          "#+date:"
    :property      "#+property:"
    :options       "#+options:"
    :startup       "#+startup:"
    :macro         "#+macro:"
    :html_head     "#+html_head:"
    :html          "#+html:"
    :latex_class   "#+latex_class:"
    :latex_header  "#+latex_header:"
    :beamer_header "#+beamer_header:"
    :latex         "#+latex:"
    :attr_latex    "#+attr_latex:"
    :attr_html     "#+attr_html:"
    :attr_org      "#+attr_org:"
    :begin_quote   "#+begin_quote"
    :end_quote     "#+end_quote"
    :caption       "#+caption:"
    :header        "#+header:"
    :begin_export  "#+begin_export"
    :end_export    "#+end_export"
    :results       "#+RESULTS:"
    :property      ":PROPERTIES:"
    :end           ":END:"
    :priority_a    "[#A]"
    :priority_b    "[#B]"
    :priority_c    "[#C]"
    :priority_d    "[#D]"
    :priority_e    "[#E]"
    :roam_tags     "#+roam_tags:"
    :filetags      "#+filetags:")
  (plist-put +ligatures-extra-symbols :name "⁍"))
#+end_src

*** Info-Colors
#+begin_src emacs-lisp
(use-package! info-colors
  :commands (info-colors-fontify-node))

(add-hook 'Info-selection-hook
          'info-colors-fontify-node)
#+end_src

** Dashboard
