config.el
;; Whenever you reconfigure a package, make sure to wrap your config in an
;; `after!' block, otherwise Doom's defaults may override your settings. E.g.

;;   (after! PACKAGE
;;     (setq x y))

;; The exceptions to this rule:
;;     - Setting file/directory variables (like `org-directory')
;;     - Setting variables which explicitly tell you to set them before their
;;         package is loaded (see 'C-h v VARIABLE' to look up their documentation).
;;     - Setting doom variables (which start with 'doom-' or '+').

;; Here are some additional functions/macros that will help you configure Doom.

;;     - `load!' for loading external *.el files relative to this one
;;     - `use-package!' for configuring packages
;;     - `after!' for running code after a package has loaded
;;     - `add-load-path!' for adding directories to the `load-path', relative to
;;          this file. Emacs searches the `load-path' when you load packages with
;;         `require' or `use-package'.
;;     - `map!' for binding new keys

;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
;; This will open documentation for it, including demos of how they are used.
;; Alternatively, use `C-h o' to look up a symbol (functions, variables, faces,
;; etc).

;; You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
;; they are implemented.

(use-package! gcmh
  :init
  (setq gcmh-idle-delay 5
        gcmh-high-cons-threshold (* 256 1024 1024))  ; 256MB during idle
  :config
  (gcmh-mode 1))

(setq gc-cons-threshold 200000000) ; previous 33554432

(setq doom-localleader-key "SPC l"
      doom-localleader-alt-key "M-SPC l")

(setq auto-save-default t
      make-backup-files t)

(setq confirm-kill-emacs nil)

(setq user-full-name "Michael Neuper"
      user-mail-address "michael@michaelneuper.com")

(load! "api-keys.el")

(when IS-MAC
  (setq mac-command-modifier 'meta
        mac-option-modifier 'super
        mac-right-option-modifier 'none))

(after! auth-source
  (setq auth-sources (nreverse auth-sources)))

(add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))  
(add-to-list 'default-frame-alist '(ns-appearance . dark))

(map! :leader
      (:prefix "t"
       :desc "Calc"
       "c" #'calc
       :desc "Eshell"
       "e" #'+eshell/toggle
       :desc "Scroll bar"
       "s" #'scroll-bar-mode
       :desc "Vterm"
       "v" #'+vterm/toggle))

(global-set-key (kbd "<f4>") #'deadgrep)
(global-set-key (kbd "<f3>") #'ibuffer)

(setq evil-split-window-below t
      evil-vsplit-window-right t)

(defadvice! prompt-for-buffers (&rest _)
  :after '(evil-window-split evil-window-vsplit)
  (consult-buffer))

;; (scroll-bar-mode 1)
;; (blink-cursor-mode 1)

;; mac specific
(when IS-MAC
  (display-battery-mode 1))

(setq doom-theme 'doom-gruvbox)

;; (custom-set-faces!
;;   '(doom-dashboard-banner :inherit default)
;;   '(doom-dashboard-loaded :inherit default)
;;   '(dashboard-banner :inherrit default))

;; (custom-set-faces!
;;   '(dashboard-startup-banner :inherit default))

(setq display-line-numbers-type 'relative)
(setq display-line-numbers-mode 'visual)
(setq display-line-numbers 'visual)

(setq display-fill-column-indicator-column 80)
(add-hook 'prog-mode-hook #'display-fill-column-indicator-mode)

(when (version< "29.0.50" emacs-version)
  (pixel-scroll-precision-mode 1))

(cond (IS-LINUX
       (setq doom-font (font-spec :family "Fira Code" :size 12.5)
             doom-variable-pitch-font (font-spec :family "Noto Sans" :size 15)))
      (IS-MAC
       (setq doom-font (font-spec :family "JetBrainsMono Nerd Font" :size 15.5))
       (setq doom-symbol-font (font-spec :family "Cascadia Code" :size 15.5))))

(after! doom-themes
  (setq doom-themes-enable-bold t))
        ;; doom-themes-enable-italic t))

;; (custom-set-faces!
;;   '(font-lock-comment-face :slant italic)
;;   '(font-lock-keyword-face :slant italic))

;; (plist-put! +ligatures-extra-symbols
;;             :and           nil
;;             :or            nil
;;             :not           nil
;;             :true          nil
;;             :false         nil
;;             :int           nil
;;             :float         nil
;;             :str           nil
;;             :bool          nil
;;             :list          nil)

(after! org
  (setq org-ellipsis " ▾ ")
  ;; (appendq! +ligatures-extra-symbols
  ;;           `(:checkbox      "☐"
  ;;             :pending       "◼"
  ;;             :checkedbox    "☑"
  ;;             :list_property "∷"
  ;;             :em_dash       "—"
  ;;             :ellipses      "…"
  ;;             :arrow_right   "→"
  ;;             :arrow_left    "←"
  ;;             :begin_quote   "❝"
  ;;             :end_quote     "❞"
  ;;             :header        "›"
  ;;             :priority_a   ,(propertize "⚑" 'face 'all-the-icons-red)
  ;;             :priority_b   ,(propertize "⬆" 'face 'all-the-icons-orange)
  ;;             :priority_c   ,(propertize "■" 'face 'all-the-icons-yellow)
  ;;             :priority_d   ,(propertize "⬇" 'face 'all-the-icons-green)
  ;;             :priority_e   ,(propertize "❓" 'face 'all-the-icons-blue)
  ;;             :roam_tags nil
  ;;             :filetags nil))
  (set-ligatures! 'org-mode
    :merge t
    :checkbox      "[ ]"
    :pending       "[-]"
    :checkedbox    "[X]"
    :list_property "::"
    :em_dash       "---"
    :ellipsis      "..."
    :arrow_right   "->"
    :arrow_left    "<-"
    :title         "#+title:"
    :subtitle      "#+subtitle:"
    :author        "#+author:"
    :date          "#+date:"
    :property      "#+property:"
    :options       "#+options:"
    :startup       "#+startup:"
    :macro         "#+macro:"
    :html_head     "#+html_head:"
    :html          "#+html:"
    :latex_class   "#+latex_class:"
    :latex_header  "#+latex_header:"
    :beamer_header "#+beamer_header:"
    :latex         "#+latex:"
    :attr_latex    "#+attr_latex:"
    :attr_html     "#+attr_html:"
    :attr_org      "#+attr_org:"
    :begin_quote   "#+begin_quote"
    :end_quote     "#+end_quote"
    :caption       "#+caption:"
    :header        "#+header:"
    :begin_export  "#+begin_export"
    :end_export    "#+end_export"
    :results       "#+RESULTS:"
    :property      ":PROPERTIES:"
    :end           ":END:"
    :priority_a    "[#A]"
    :priority_b    "[#B]"
    :priority_c    "[#C]"
    :priority_d    "[#D]"
    :priority_e    "[#E]"
    :roam_tags     "#+roam_tags:"
    :filetags      "#+filetags:")
  (plist-put +ligatures-extra-symbols :name "⁍"))

(use-package! info-colors
  :commands (info-colors-fontify-node))

(add-hook 'Info-selection-hook
          'info-colors-fontify-node)
