config.org
*** doom-dashboard
Remove menus.
#+begin_src emacs-lisp
(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-shortmenu)


(add-hook! '+doom-dashboard-functions :append
  (insert "\n" (+doom-dashboard--center +doom-dashboard--width "Welcome back to Emacs!"))
  (setq mode-line-format nil)
  (hl-line-mode 0)
  (read-only-mode +1))

(setq-hook! '+doom-dashboard-mode-hook evil-normal-state-cursor (list nil))
#+end_src

Custom ASCII banner.
#+begin_src emacs-lisp
(defun my-weebery-is-always-greater ()
  (let* ((banner '("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⠀⠀⠀⠀⠀⠀⡀⠀⠀⠀⠀⠀⠀⠀⠀"
                   "⢸⠉⣹⠋⠉⢉⡟⢩⢋⠋⣽⡻⠭⢽⢉⠯⠭⠭⠭⢽⡍⢹⡍⠙⣯⠉⠉⠉⠉⠉⣿⢫⠉⠉⠉⢉⡟⠉⢿⢹⠉⢉⣉⢿⡝⡉⢩⢿⣻⢍⠉⠉⠩⢹⣟⡏⠉⠹⡉⢻⡍⡇"
                   "⢸⢠⢹⠀⠀⢸⠁⣼⠀⣼⡝⠀⠀⢸⠘⠀⠀⠀⠀⠈⢿⠀⡟⡄⠹⣣⠀⠀⠐⠀⢸⡘⡄⣤⠀⡼⠁⠀⢺⡘⠉⠀⠀⠀⠫⣪⣌⡌⢳⡻⣦⠀⠀⢃⡽⡼⡀⠀⢣⢸⠸⡇"
                   "⢸⡸⢸⠀⠀⣿⠀⣇⢠⡿⠀⠀⠀⠸⡇⠀⠀⠀⠀⠀⠘⢇⠸⠘⡀⠻⣇⠀⠀⠄⠀⡇⢣⢛⠀⡇⠀⠀⣸⠇⠀⠀⠀⠀⠀⠘⠄⢻⡀⠻⣻⣧⠀⠀⠃⢧⡇⠀⢸⢸⡇⡇"
                   "⢸⡇⢸⣠⠀⣿⢠⣿⡾⠁⠀⢀⡀⠤⢇⣀⣐⣀⠀⠤⢀⠈⠢⡡⡈⢦⡙⣷⡀⠀⠀⢿⠈⢻⣡⠁⠀⢀⠏⠀⠀⠀⢀⠀⠄⣀⣐⣀⣙⠢⡌⣻⣷⡀⢹⢸⡅⠀⢸⠸⡇⡇"
                   "⢸⡇⢸⣟⠀⢿⢸⡿⠀⣀⣶⣷⣾⡿⠿⣿⣿⣿⣿⣿⣶⣬⡀⠐⠰⣄⠙⠪⣻⣦⡀⠘⣧⠀⠙⠄⠀⠀⠀⠀⠀⣨⣴⣾⣿⠿⣿⣿⣿⣿⣿⣶⣯⣿⣼⢼⡇⠀⢸⡇⡇⠇"
                   "⢸⢧⠀⣿⡅⢸⣼⡷⣾⣿⡟⠋⣿⠓⢲⣿⣿⣿⡟⠙⣿⠛⢯⡳⡀⠈⠓⠄⡈⠚⠿⣧⣌⢧⠀⠀⠀⠀⠀⣠⣺⠟⢫⡿⠓⢺⣿⣿⣿⠏⠙⣏⠛⣿⣿⣾⡇⢀⡿⢠⠀⡇"
                   "⢸⢸⠀⢹⣷⡀⢿⡁⠀⠻⣇⠀⣇⠀⠘⣿⣿⡿⠁⠐⣉⡀⠀⠁⠀⠀⠀⠀⠀⠀⠀⠀⠉⠓⠳⠄⠀⠀⠀⠀⠋⠀⠘⡇⠀⠸⣿⣿⠟⠀⢈⣉⢠⡿⠁⣼⠁⣼⠃⣼⠀⡇"
                   "⢸⠸⣀⠈⣯⢳⡘⣇⠀⠀⠈⡂⣜⣆⡀⠀⠀⢀⣀⡴⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢽⣆⣀⠀⠀⠀⣀⣜⠕⡊⠀⣸⠇⣼⡟⢠⠏⠀⡇"
                   "⢸⠀⡟⠀⢸⡆⢹⡜⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⠋⣾⡏⡇⡎⡇⠀⡇"
                   "⢸⠀⢃⡆⠀⢿⡄⠑⢽⣄⠀⠀⠀⢀⠂⠠⢁⠈⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⠀⠄⡐⢀⠂⠀⠀⣠⣮⡟⢹⣯⣸⣱⠁⠀⡇"
                   "⠈⠉⠉⠉⠉⠉⠉⠉⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠉⠉⠉⠉⠉⠉⠉⠉⠁"))
         (longest-line (apply #'max (mapcar #'length banner))))
    (put-text-property
     (point)
     (dolist (line banner (point))
       (insert (+doom-dashboard--center
                +doom-dashboard--width
                (concat line (make-string (max 0 (- longest-line (length line))) 32)))
               "\n"))
     'face 'doom-dashboard-banner)))

(setq +doom-dashboard-ascii-banner-fn #'my-weebery-is-always-greater)
#+end_src

Image banner.
#+begin_src emacs-lisp
;; (setq fancy-splash-image (concat doom-private-dir "splashes/gnu/trancendent-gnu-medium.xpm"))
#+end_src

*** dashboard
Switch to dashboard from doom-dashboard.
#+begin_src emacs-lisp
;; (setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*")))
;; (setq doom-fallback-buffer-name "*dashboard*")
#+end_src

Configure dashboard
#+begin_src emacs-lisp
;; (use-package! dashboard
;;   :custom-face
;;   (dashboard-heading ((t (:inherit (font-lock-string-face bold)))))
;;   (dashboard-banner ((t (:inherit default))))
;;   :hook
;;   (dashboard-mode . (lambda ()
;;                       ;; Enable `page-break-lines-mode'
;;                       (when (fboundp 'page-break-lines-mode)
;;                         (page-break-lines-mode 1))))
;;   :init
;;   ;; (setq dashboard-items '((recents . 4)
;;   ;;                         (projects . 3)
;;   ;;                         (bookmarks . 5))
;;   (setq dashboard-show-shortcuts t
;;         dashboard-center-content nil
;;         ;; dashboard-startup-banner 'logo
;;         dashboard-startup-banner (concat doom-user-dir "splashes/gnu/trancendent-gnu-medium.xpm")
;;         dashboard-banner-logo-title "Welcome Back to Emacs!"
;;         dashboard-page-separator "\n\f\n"
;;         dashboard-display-icons-p t
;;         dashboard-set-file-icons t
;;         dashboard-set-heading-icons t
;;         dashboard-set-navigator t)
;;   ;; Format: "(icon title help action face prefix suffix)"
;;   ;; (setq dashboard-navigator-buttons
;;   ;;       `(;; line 1
;;   ;;         ((,(nerd-icons-faicon "nf-fa-github" :height 1.0 :v-adjust 0.0)
;;   ;;           "GitHub"
;;   ;;           "Browse GitHub"
;;   ;;           (lambda (&rest _) (browse-url "https://github.com/michaelneuper"))))
;;   ;;         (;; line 2
;;   ;;          (,(nerd-icons-faicon "nf-fa-calendar" :height 1.0 :v-adjust 0.0)
;;   ;;           "Agenda"
;;   ;;           "View org-agenda"
;;   ;;           (lambda (&rest _) (org-agenda-list)) warning)
;;   ;;          (,(nerd-icons-faicon "nf-fa-book" :height 1.0 :v-adjust 0.0)
;;   ;;           "Docs"
;;   ;;           "Show documentation"
;;   ;;           (lambda (&rest _) (doom/help)) warning))))
;;   :config
;;   (dashboard-setup-startup-hook))
#+end_src

Exclude files from showing in recents.
#+begin_src emacs-lisp
;; (add-to-list 'recentf-exclude (file-truename "~/Repos/dotfiles/.config/emacs/elpa"))
;; (add-to-list 'recentf-exclude (file-truename "~/Repos/dotfiles/.config/emacs/.local/etc/workspaces/autosave(file-truename "))
;; (add-to-list 'recentf-exclude (file-truename "~/Repos/dotfiles/.config/emacs/bookmarks"))
;; (add-to-list 'recentf-exclude (file-truename "~/Repos/dotfiles/.config/emacs/recentf"))
;; (add-to-list 'recentf-exclude (file-truename "~/Repos/dotfiles/.config/emacs/ido.last"))
;; (add-to-list 'recentf-exclude (file-truename "~/.cache/treemacs-persist"))
#+end_src

** Modeline
Enable nyan-cat in modeline.

#+begin_src emacs-lisp
(when (eq system-type 'gnu/linux)
  (use-package! nyan-mode
    :init
    (nyan-mode 1)
    :config
    (setq nyan-animate-nyancat t
          nyan-wavy-trail t)))
#+end_src

Enable extra icons in doom-modeline.

#+begin_src emacs-lisp
(after! doom-modeline
  (setq doom-modeline-enable-word-count nil
        doom-modeline-persp-name t
        doom-modeline-persp-icon t
        doom-modeline-major-mode-icon t))
#+end_src

** Tabs
#+begin_src emacs-lisp
(after! centaur-tabs
  :ensure t
  :config
  (setq centaur-tabs-style "bar"
        centaur-tabs-set-bar 'left
        centaur-tabs-height 32
        centaur-tabs-set-icons t
        centaur-tabs-gray-out-icons 'buffer)
  (centaur-tabs-headline-match)
  (centaur-tabs-mode t)
  (centaur-tabs-group-by-projectile-project))
#+end_src

