config.org
** TODO SVG Tags
Enable SVG tags in org mode.

#+begin_src emacs-lisp
;; (require 'svg-tag-mode)

;; (defconst date-re "[0-9]\\{4\\}-[0-9]\\{2\\}-[0-9]\\{2\\}")
;; (defconst time-re "[0-9]\\{2\\}:[0-9]\\{2\\}")
;; (defconst day-re "[A-Za-z]\\{3\\}")
;; (defconst day-time-re (format "\\(%s\\)? ?\\(%s\\)?" day-re time-re))

;; (defun svg-progress-percent (value)
;;   (svg-image (svg-lib-concat
;;               (svg-lib-progress-bar (/ (string-to-number value) 100.0)
;;                                     nil :margin 0 :stroke 2 :radius 3 :padding 2 :width 11)
;;               (svg-lib-tag (concat value "%")
;;                            nil :stroke 0 :margin 0)) :ascent 'center))

;; (defun svg-progress-count (value)
;;   (let* ((seq (mapcar #'string-to-number (split-string value "/")))
;;          (count (float (car seq)))
;;          (total (float (cadr seq))))
;;     (svg-image (svg-lib-concat
;;                 (svg-lib-progress-bar (/ count total) nil
;;                                       :margin 0 :stroke 2 :radius 3 :padding 2 :width 11)
;;                 (svg-lib-tag value nil
;;                              :stroke 0 :margin 0)) :ascent 'center)))

;; (setq svg-tag-tags
;;       `(
;;         ;; Org tags :TAG1:TAG2:TAG3:
;;         (":\\([A-Za-z0-9]+\\)" . ((lambda (tag) (svg-tag-make tag))))
;;         (":\\([A-Za-z0-9]+[ \-]\\)" . ((lambda (tag) tag)))

;;         ;; Org tags #+author
;;         ("#\+\\([A-Za-z0-9]+\\)" . ((lambda (tag) (svg-tag-make tag))))
;;         ("#\+\\([A-Za-z0-9]+[ \-]\\)" . ((lambda (tag) tag)))

;;         ;; Task priority [#A] [#B] [#C]
;;         ("\\[#[A-Z]\\]" . ( (lambda (tag)
;;                               (svg-tag-make tag :face 'org-priority
;;                                             :beg 2 :end -1 :margin 0))))

;;         ;; Progress [1/3]
;;         ("\\(\\[[0-9]\\{1,3\\}%\\]\\)" . ((lambda (tag)
;;                                             (svg-progress-percent (substring tag 1 -2)))))
;;         ("\\(\\[[0-9]+/[0-9]+\\]\\)" . ((lambda (tag)
;;                                           (svg-progress-count (substring tag 1 -1)))))

;;         ;; TODO / DONE
;;         ("TODO" . ((lambda (tag) (svg-tag-make "TODO" :face 'org-todo :inverse t :margin 0))))
;;         ("DONE" . ((lambda (tag) (svg-tag-make "DONE" :face 'org-done :margin 0))))

;;         ;; Citation of the form [cite:@Knuth:1984]
;;         ("\\(\\[cite:@[A-Za-z]+:\\)" . ((lambda (tag)
;;                                           (svg-tag-make tag
;;                                                         :inverse t
;;                                                         :beg 7 :end -1
;;                                                         :crop-right t))))
;;         ("\\[cite:@[A-Za-z]+:\\([0-9]+\\]\\)" . ((lambda (tag)
;;                                                    (svg-tag-make tag
;;                                                                  :end -1
;;                                                                  :crop-left t))))


;;         ;; Active date (with or without day name, with or without time) <2021-12-24 Fri 14:00>
;;         (,(format "\\(<%s>\\)" date-re) .
;;          ((lambda (tag)
;;             (svg-tag-make tag :beg 1 :end -1 :margin 0))))
;;         (,(format "\\(<%s \\)%s>" date-re day-time-re) .
;;          ((lambda (tag)
;;             (svg-tag-make tag :beg 1 :inverse nil :crop-right t :margin 0))))
;;         (,(format "<%s \\(%s>\\)" date-re day-time-re) .
;;          ((lambda (tag)
;;             (svg-tag-make tag :end -1 :inverse t :crop-left t :margin 0))))

;;         ;; Inactive date  (with or without day name, with or without time) [2021-12-24 Fri 14:00]
;;         (,(format "\\(\\[%s\\]\\)" date-re) .
;;          ((lambda (tag)
;;             (svg-tag-make tag :beg 1 :end -1 :margin 0 :face 'org-date))))
;;         (,(format "\\(\\[%s \\)%s\\]" date-re day-time-re) .
;;          ((lambda (tag)
;;             (svg-tag-make tag :beg 1 :inverse nil :crop-right t :margin 0 :face 'org-date))))
;;         (,(format "\\[%s \\(%s\\]\\)" date-re day-time-re) .
;;          ((lambda (tag)
;;             (svg-tag-make tag :end -1 :inverse t :crop-left t :margin 0 :face 'org-date))))))

;; (add-hook! 'org-mode-hook '(svg-tag-mode t))
#+end_src

* Evil Mode
Raise undo limit to 80mb.

#+begin_src emacs-lisp
(setq undo-limit 80000000)
#+end_src

Grandular changes when in insert mode.

#+begin_src emacs-lisp
(setq evil-want-fine-undo t)
#+end_src

Use block cursor in insert mode.

#+begin_src emacs-lisp
;; (defun my-set-evil-insert-state-cursor ()
;;   (unless (derived-mode-p 'eshell-mode)
;;     (setq evil-insert-state-cursor 'box)))

;; (add-hook 'post-command-hook 'my-set-evil-insert-state-cursor)
#+end_src

* Dired/Dirvish
#+begin_src emacs-lisp
(after! dirvish
  (setq! dirvish-quick-access-entries
         `(("h" "~/"           "Home")
           ("e" ,doom-user-dir "Doom config")
           ("c" "~/Developer/" "Code")
           ("d" "~/Downloads/" "Downloads")
           ("g" "~/GitHub/"    "GitHub")
           ("t" "~/.Trash/"    "Trash"))))
#+end_src

* Programming
** LSP
#+begin_src emacs-lisp
(use-package! lsp-mode
  :init
  (setq lsp-enable-symbol-highlighting nil
        lsp-lens-enable nil
        lsp-headerline-breadcrumb-enable nil
        lsp-modeline-code-actions-enable t
        lsp-diagnostics-provider :flycheck
        lsp-completion-show-detail t
        lsp-completion-show-kind t))

(use-package! lsp-ui
  :init
  (setq lsp-ui-doc-enable nil
        lsp-ui-sideline-enable nil))
#+end_src

** Company
#+begin_src emacs-lisp
(add-hook 'after-init-hook 'global-company-mode)
;; from modules/completion/company/config.el
(use-package! company
  :commands (company-mode global-company-mode company-complete
                          company-complete-common company-manual-begin company-grab-line)
  :config
  (setq company-idle-delay nil
        company-tooltip-limit 10
        company-dabbrev-downcase nil
        company-dabbrev-ignore-case nil)
  [...])

(map! "M-RET" #'company-manual-begin)
#+end_src

** Eshell
#+begin_src emacs-lisp
(setq eshell-rc-script (concat doom-user-dir "eshell/profile")
      eshell-aliases-file (concat doom-user-dir "eshell/aliases")
      eshell-history-size 5000
      eshell-buffer-maximum-lines 5000
      eshell-hist-ignoredups t
      eshell-scroll-to-bottom-on-input t
      eshell-destroy-buffer-when-process-dies t
      eshell-visual-commands'("fish" "htop" "ssh" "top" "zsh"))
#+end_src

** Copilot
#+begin_src emacs-lisp
(after! (evil copilot)
  ;; Define the custom function that either accepts the completion or does the default behavior
  (defun my/copilot-tab-or-default ()
    (interactive)
    (if (and (bound-and-true-p copilot-mode)
             ;; Add any other conditions to check for active copilot suggestions if necessary
             )
        (copilot-accept-completion)
      (evil-insert 1))) ; Default action to insert a tab. Adjust as needed.

  ;; Bind the custom function to <tab> in Evil's insert state
  (evil-define-key 'insert 'global (kbd "<tab>") 'my/copilot-tab-or-default))
#+end_src

** Tabnine
Enable tabnine.

#+begin_src emacs-lisp
;; (require 'company-tabnine)
;; (add-to-list 'company-backends #'company-tabnine)
#+end_src

Configure tabnine.

#+begin_src emacs-lisp
;; (setq company-idle-delay 0
;;       company-show-numbers t)
#+end_src

** Languages
*** LaTeX
Change LaTeX compiler to XeLaTeX.
#+begin_src emacs-lisp
(add-hook! 'latex-mode-hook
  (setq TeX-engine 'xetex) 99)
#+end_src

Make AUCTeX aware of syle files and multi-file documents right away.
#+begin_src emacs-lisp
(setq TeX-auto-save t
      TeX-parse-self t)
(setq-default TeX-master nil)
#+end_src

Reorder list of pdf viewers.
#+begin_src emacs-lisp
(setq +latex-viewers '(pdf-tools zathura))
#+end_src

Make pdf-tools automatically update the buffer.
#+begin_src emacs-lisp
(setq auto-revert-interval 0.5)
#+end_src

Use cdlatex completion instead of yasnippet.
#+begin_src emacs-lisp
(map! :map cdlatex-mode-map
      :i "TAB" #'cdlatex-tab)
#+end_src

CDLaTeX keybindings.
#+begin_src emacs-lisp
(map! :after latex
      :map cdlatex-mode-map
      :localleader
      :desc "Insert math symbol"
      "i" #'cdlatex-math-symbol
      :desc "Begin environment"
      "e" #'cdlatex-environment)
#+end_src

Use lazytab package.
#+begin_src emacs-lisp
;; (load! lazytab.el)
#+end_src

