config.el
      (:prefix ("e" . "evaluate")
       :desc "Evaluate elisp in buffer"
       "b" #'eval-buffer
       :desc "Evaluate defun"
       "d" #'eval-defun
       :desc "Evaluate elisp expression"
       "e" #'eval-expression
       :desc "Evaluate last sexpression"
       "l" #'eval-last-sexp
       :desc "Evaluate elisp in region"
       "r" #'eval-region))

(after! lsp-mode (require 'lsp-java))

(after! lsp-java
  (add-hook 'java-mode-hook #'lsp)
  (add-hook 'java-mode-hook
            (lambda ()
              (setq c-basic-offset 4
                    tab-width 4
                    indent-tabs-mode nil))))

(map! :after lsp-java
      :map java-mode-map
      :localleader
      :desc "Add missings imports"
      "i" #'lsp-java-add-import
      :desc "Organize imports"
      "o" #'lsp-java-organize-imports
      :desc "Build project"
      "b" #'lsp-java-build-project
      :desc "Add toString()"
      "t" #'lsp-java-generate-to-string
      :desc "Generate getters and setters"
      "g" #'lsp-java-generate-getters-and-setters
      :desc "Extract to method"
      "m" #'lsp-java-extract-method
      :desc "Extract to constant"
      "c" #'lsp-java-extract-to-constant
      :desc "Extract to local variable"
      "v" #'lsp-java-extract-to-local-variable)

(after! text-mode
  (add-hook! 'text-mode-hook
    (unless (derived-mode-p 'org-mode)
      (with-silent-modifications
        (ansi-color-apply-on-region (point-min) (point-max) t)))))

(use-package! lsp-pyright
:ensure t
:hook (python-mode . (lambda ()
                        (require 'lsp-pyright)
                        (lsp-deferred))))  ; or lsp-deferred

(add-hook! python-mode
  (setq lsp-pyright-python-executable-cmd "/opt/homebrew/bin/python3.8"
        python-shell-interpreter "python3.8"
        doom-modeline-env-python-executable "python3.8"))

(setq org-directory "~/Documents/Org"
      org-use-property-inheritance t ; fix weird issue with src blocks
      org-startup-with-inline-images t)
;; org-startup-with-latex-preview t)

(after! org
  (setq display-line-numbers-mode 'visual))
  ;; (org-sticky-header-mode))

(when IS-MAC
  (use-package! org-mac-link
    :after org
    :config
    (setq org-mac-grab-Acrobat-app-p nil ; disable grabbing from Adobe Acrobat
          org-mac-grab-devonthink-app-p nil) ; disable grabbinb from DevonThink
    (map! :map org-mode-map
          :leader
          (:prefix "o"
           :desc "Grab mac link"
           "g" #'org-mac-grab-link))))

(require 'org)
(add-to-list 'org-latex-packages-alist '("" "amsmath" t))
(add-to-list 'org-latex-packages-alist '("" "amssymb" t))
(add-to-list 'org-latex-packages-alist '("" "mathtools" t))
(add-to-list 'org-latex-packages-alist '("" "mathrsfs" t))
(setq org-preview-latex-default-process 'dvisvgm
      org-format-latex-options (plist-put org-format-latex-options :scale 2.0))

;; xenops
(add-hook 'org-mode-hook #'xenops-mode)
(setq xenops-math-image-scale-factor 1.7
      xenops-reveal-on-entry t)

(defun mn/text-scale-adjust-latex-previews ()
  "Adjust the size of latex preview fragments when changing the
buffer's text scale."
  (pcase major-mode
    ('latex-mode
     (dolist (ov (overlays-in (point-min) (point-max)))
       (if (eq (overlay-get ov 'category)
               'preview-overlay)
           (mn/text-scale--resize-fragment ov))))
    ('org-mode
     (dolist (ov (overlays-in (point-min) (point-max)))
       (if (eq (overlay-get ov 'org-overlay-type)
               'org-latex-overlay)
           (mn/text-scale--resize-fragment ov))))))

(defun mn/text-scale--resize-fragment (ov)
  (overlay-put
   ov 'display
   (cons 'image
         (plist-put
          (cdr (overlay-get ov 'display))
          :scale (+ 1.0 (* 0.25 text-scale-mode-amount))))))

(add-hook 'text-scale-mode-hook #'mn/text-scale-adjust-latex-previews)

(after! org
  (setq org-agenda-files
        '("~/Documents/Org/" "~/Documents/Agenda/" "~/Notes/")))

;; (add-to-list 'org-src-lang-modes '("mathematica" . wolfram))
(autoload 'wolfram-mode "wolfram-mode" nil t) (autoload 'run-wolfram "wolfram-mode" nil t) (setq wolfram-program "/Applications/Mathematica.app/Contents/MacOS/MathKernel")
(add-to-list 'auto-mode-alist '("\.m$" . wolfram-mode)) (setq wolfram-path "/Users/michael/Library/Mathematica/Kernel")
;; Load mathematica from contrib
(org-babel-do-load-languages 'org-babel-load-languages
                             (append org-babel-load-languages
                                     '((mathematica . t))
                                     ))
;; Sanitize output and deal with paths
(setq org-babel-mathematica-command "~/.local/bin/mash.pl")
;; Font-locking
(add-to-list 'org-src-lang-modes '("mathematica" . wolfram))
;; For wolfram-mode
(setq mathematica-command-line "~/.local/bin/mash.pl")

(defun mn/babel-ansi ()
  (when-let ((beg (org-babel-where-is-src-block-result nil nil)))
    (save-excursion
      (goto-char beg)
      (when (looking-at org-babel-result-regexp)
        (let ((end (org-babel-result-end))
              (ansi-color-context-region nil))
          (ansi-color-apply-on-region beg end))))))

(add-hook 'org-babel-after-execute-hook 'mn/babel-ansi)

(setq org-feed-alist
      '(("Michael's Feed"
         "https://michaelneuper.com/index.xml"
         "~/Documents/Org/feeds.org" "Michael's Entries")))

(use-package! org-roam
  :ensure t
  :config
  ;; Settings
  (setq org-roam-directory (file-truename "~/Notes")
        org-attach-id-dir "assets/")
  (org-roam-db-autosync-enable)
  ;; Keybindings
  (map! :map org-mode-map
        :leader
        (:prefix ("r")
         :desc "Insert node"
         "i" #'org-roam-node-insert
         :desc "Find node"
         "f" #'org-roam-node-find
         :desc "Capture to node"
         "c" #'org-roam-capture
         :desc "Toggle roam buffer"
         "b" #'org-roam-buffer-toggle
         :desc "Open random note"
         "r" #'org-roam-node-random
         :desc "Visit node"
         "v" #'org-roam-node-visit))
  (map! :leader ; unbind default doom binding
        "n r n" nil))
  ;; Capture templates
  ;; (org-roam-capture-templates
  ;;  '(("d" "default" plain
  ;;     "%?"
  ;;     :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
  ;;     :unnarrowed t)
  ;;    ("m" "math" plain
  ;;     "%?"
  ;;     :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+startup: latexpreview\n")
  ;;     :unnarrowed t))))

(use-package! websocket
  :after org-roam)

(use-package! org-roam-ui
  :after org-roam ;; or :after org
  ;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
  ;;         a hookable mode anymore, you're advised to pick something yourself
  ;;         if you don't care about startup time, use
  ;;  :hook (after-init . org-roam-ui-mode)
  :config
  ;; Settings
  (setq org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start t)
  ;; Keybindings
  (map! :leader
        (:prefix "r"
         :desc "Open UI"
         "u" #'org-roam-ui-open)))

;; (setq org-logseq-dir "")
