config.org
*** Ox-Hugo
#+begin_src emacs-lisp
(use-package ox-hugo
  :ensure t
  :pin melpa
  :after ox)
#+end_src

#+begin_src emacs-lisp
(use-package blog
  :commands (blog-publish-file
             blog-generate-file-name
             blog-read-list-items)
  :preface
  (defvar blog-capture-template
    "#+hugo_base_dir: ../
#+hugo_section: posts
#+hugo_auto_set_lastmod: t
#+options: tex:dvisvgm
#+macro: kbd @@html:<kbd>$1</kbd>@@

#+title: %(format \"%s\" blog--current-post-name)
#+date: %(format-time-string \"%Y-%m-%d %h %H:%M\")
#+hugo_tags: %(blog-read-list-items \"Select tags: \" 'blog-tags)
#+hugo_categories: %(blog-read-list-items \"Select categories: \" 'blog-categories)
#+hugo_custom_front_matter: :license %(format \"%S\" blog-license)

%?"
    "Org-capture template for blog posts.")
  (defcustom blog-tags nil
    "A list of tags used for posts."
    :type '(repeat string)
    :group 'blog)
  (defcustom blog-categories nil
    "A list of tags used for posts."
    :type '(repeat string)
    :group 'blog)
  (defcustom blog-directory "~/blog"
    "Location of the blog directory for org-capture."
    :type 'string
    :group 'blog)
  (defcustom blog-license ""
    "Blog license string."
    :type 'string
    :group 'blog)
  (defvar blog--current-post-name nil
    "Current post name for org-capture template.")
  (defun blog-read-list-items (prompt var)
    "Completing read items with the PROMPT from the VAR.

VAR must be a quoted custom variable, which will be saved if new
items were read by the `completing-read' function."
    (let ((items (eval var)) item result)
      (while (not (string-empty-p item))
        (setq item (string-trim (or (completing-read prompt items) "")))
        (unless (string-empty-p item)
          (push item result)
          (setq items (remove item items))
          (unless (member item (eval var))
            (customize-save-variable var (sort (cons item (eval var)) #'string<)))))
      (string-join result " ")))
  (defun blog-title-to-fname (title)
    (thread-last
      title
      (replace-regexp-in-string "[[:space:]]" "-")
      (replace-regexp-in-string "-+" "-")
      (replace-regexp-in-string "[^[:alnum:]-]+" "")
      downcase))
  (defun blog-generate-file-name (&rest _)
    (let ((title (read-string "Title: ")))
      (setq blog--current-post-name title)
      (find-file
       (file-name-concat
        (expand-file-name blog-directory)
        "posts"
        (format "%s-%s.org"
                (format-time-string "%Y-%m-%d")
                (blog-title-to-fname title))))))
  (defun blog-publish-file ()
    "Update '#+date:' tag, and rename the currently visited file.
File name is updated to include the same date and current title."
    (interactive)
    (save-match-data
      (let ((today (format-time-string "%Y-%m-%d"))
            (now (format-time-string "%h %H:%M")))
        (save-excursion
          (goto-char (point-min))
          (re-search-forward "^#\\+date:.*$")
          (replace-match (format "#+date: %s %s" today now)))
        (let* ((file-name (save-excursion
                            (goto-char (point-min))
                            (re-search-forward "^#\\+title:[[:space:]]*\\(.*\\)$")
                            (blog-title-to-fname (match-string 1)))))
          (condition-case nil
              (rename-visited-file
               (format "%s-%s.org" today
                       (if (string-match
                            "^[[:digit:]]\\{4\\}-[[:digit:]]\\{2\\}-[[:digit:]]\\{2\\}-\\(.*\\)$"
                            file-name)
                           (match-string 1 file-name)
                         file-name)))
            (file-already-exists nil))
          (save-buffer)))))
  (provide 'blog))
#+end_src

* Other Packages
** Spotify
Enable and configure smudge.

#+begin_src emacs-lisp
(use-package! smudge
  :init
  (setq smudge-status-location 'modeline
        smudge-transport 'connect) ; requires spotify premium
  :config
  ;; General keybindings
  (map! :leader
        (:prefix ("m" . "music")
         :desc "Toggle shuffle"
         "s" #'smudge-controller-toggle-shuffle
         :desc "Toggle repeat"
         "r" #'smudge-controller-toggle-repeat
         :desc "Play/pause"
         "SPC" #'smudge-controller-toggle-play
         :desc "Next track"
         "f" #'smudge-controller-next-track
         :desc "Next track"
         "n" #'smudge-controller-next-track
         :desc "Previous track"
         "b" #'smudge-controller-previous-track
         :desc "My playlists"
         "m" #'smudge-my-playlists
         :desc "Select playback device"))
  ;; Playlist keybindings
  (map! :leader
        (:prefix ("m p" . "playlists")
         :desc "Featured playlists"
         "f" #'smudge-featured-playlists
         :desc "Search playlists"
         "s" #'smudge-playlist-search
         :desc "Show user's playlists"
         "u" #'smudge-user-playlists
         :desc "Create new playlist"
         "c" #'smudge-create-playlist))
  ;; Track keybindings
  (map! :leader
        (:prefix ("m t" . "tracks")
         :desc "List recently played tracks"
         "r" #'smudge-recently-played
         :desc "Search for trakcs"
         "s" #'smudge-track-search))
  ;; Volume keybindings
  (map! :leader
        (:prefix ("m v" . "volume")
         :desc "Increase volume"
         "u" #'smudge-controller-volume-up
         :desc "Decrease volume"
         "d" #'smudge-controller-volume-down
         :desc "Toggle mute"
         "m" #'smudge-controller-voume-mute-unmute)))
#+end_src

** Calibre
#+begin_src emacs-lisp
(use-package calibredb
  :defer t
  :config
  (setq calibredb-root-dir "~/Books"
        calibredb-db-dir (expand-file-name "metadata.db" calibredb-root-dir)
        calibredb-library-alist '(("~/Books"))))
#+end_src

** Calc
#+begin_src emacs-lisp
(setq calc-angle-mode 'rad
      calc-complex-format 'i
      calc-prefer-frac t)
#+end_src
